<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads ArchiCAD 25</string>
    <key>Identifier</key>
    <string>com.github.rogerhostettler.autopkg.download.archicad25</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>afarchicad25</string>
        <key>DOWNLOAD_URL</key>
        <string>https://www.idc.ch/fileadmin/user_upload/Daten/downloads/version/ac25/CHE/ARCHICAD-25-CHE-4013-1.0.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>